[
    {
        "mainHeader" : {
            "softwareDev" : "Full-Stack Software Developer"
        },
        "downloadButton" : "Download Resume",
        "dialogs" : {
            "settings": {
                "title": "Settings",
                "languageSelect" : "Select a language:",
                "languages" : ["English", "Spanish"],
                "enable" : "Enable",
                "disable" : "Disable",
                "background" : "background",
                "playGame" : "Play Game",
                "themeTitle" : "Select a theme",
                "themes" : {
                    "default": "Default",
                    "light": "Light", 
                    "dark": "Dark"   
                }
            },
            "game": {
                "title" : "Game Over!",
                "content" : "You survived {survivalTime} seconds!" 
            }
        },
        "sections" : {
            "personalStatement": {
                "bulletins" : [
                    {
                        "title": "Personal Statement",
                        "description" : "Experienced full-stack software developer skilled in designing and implementing robust software solutions. Proficient in various programming languages and frameworks, with a focus on creating efficient and scalable applications. Known for delivering high-quality code and innovative solutions that meet project requirements and exceed client expectations."
                    }
                ]
            },
            "keySkills" : {
                "bulletins" : [
                    {
                        "title" : "Key Skills",
                        "description": [
                            "Programming Languages: Java, Python, Go, Ruby, TypeScript, JavaScript, C/C++",
                            "Web Development: React, Angular (13-16), Next.js, Node.js, HTML5, CSS, XML",
                            "Backend Development: Spring Boot, RESTful APIs, Web Services, SQL, PostgreSQL, Microsoft SQL Server",
                            "DevOps and Version Control: Git, GitHub, CI/CD",
                            "Operating Systems: Windows, Linux",
                            "Methodologies: Agile, Scrum",
                            "Other Skills: Full-stack development, User Interface (UI) design, Web accessibility, Debugging"
                        ]
                    }
                ]
            },
            "experience" : {
                "sectionTitle" : "Experience",
                "bulletins" : [
                    {
                        "title" : "Bay Bridge Administrators - EDI Programmer/Analyst",
                        "description" : [
                            "Developed a toolset for decrypting, reading, and converting from CSV/XML/834 file types into a proprietary file format.",
                            "Created a process for one-time enrollment of insurance subscriber data, using statistical methods to map subscriber data to the database.",
                            "Developed a backend in Go using Fiber, to access data and utilize the tools within the frontend.",
                            "Created a Proof of Concept for the frontend in Python using Tkinter; currently evaluating migration to Angular, TypeScript, or Windows Presentation Foundation."
                        ],
                        "dates" : "August 2024 – Current"
                    },
                    {
                        "title" : "General Motors - Lead Full-Stack Software Developer",
                        "description" : [
                            "Led the design and implementation of a vehicle diagnostic web application that would feed data into the main eDiagnostics web application, which serves as a dynamic tool for technicians to manage diagnostic and repair steps, enhancing workflow efficiency.",
                            "Engineered a robust backend with Java Spring Boot and designed a user-friendly UI with Angular, informed by insights from collaborating with production-line engineers and technicians.",
                            "The successful launch of this application improved production performance, reduced faulty vehicles, and provided a platform for continuous training.",
                            "The application also features a unique capability to resolve defects. Initially, it resolved around 2,000 unique defects from a growing list, in collaboration with a team of experts. Designed for use by other qualified individuals, it continues to improve the efficiency of the defect management process."
                        ],
                        "dates" : "June 2022 – February 2024"
                    },
                    {
                        "title" : "General Motors - Full-Stack Software Developer",
                        "description" : [
                            "Collaborated with engineers, diagnosticians, and business leaders daily to develop a web application that trains technicians to resolve error codes during vehicle assembly.",
                            "Designed frontend solutions to work across desktop and mobile devices that displayed vehicle diagnostic information in a cohesive manner.",
                            "Designed and developed Restful API endpoints for collecting vehicle defect data."
                        ],
                        "dates" : "November 2021 – June 2022"
                    },
                    {
                        "title" : "General Motors - Software Developer",
                        "description" : [
                            "Collaborated with a cross-functional team to develop a streamlined process for the creation and collection of thousands of synthetic data images, enhancing the efficiency of data gathering.",
                            "Utilized the collected synthetic data to improve the performance of computer vision systems, leading to more accurate and reliable results in real-world applications.",
                            "Contributed to the rigorous training and testing of the computer vision systems using the synthetic image data, ensuring the systems’ robustness and adaptability to various vehicle defects."
                        ],
                        "dates" : "July 2021 – November 2021"
                    },
                    {
                        "title" : "The University of Texas at El Paso (UTEP) - ACES Coordinator/Tutor",
                        "description" : [
                            "Developed a Java-based tutoring tracking tool to streamline tutoring services, improving productivity and resource allocation.",
                            "Created features for logging and tracking hours and sorting tutors and students by majors and courses, enhancing time management and student-tutor matching.",
                            "Tutored approximately 35 students weekly across majors like Computer Science, Electrical Engineering, Business, etc., in subjects like Computer Science, Computer Architecture, Calculus, Statistics, and Physics.",
                            "Implemented personalized tutoring strategies that significantly improved students’ course scores and fostered a supportive learning environment."
                        ],
                        "dates" : "March 2019 – May 2021"
                    }
                ]
            },
            "project" : {
                "sectionTitle": "Projects",
                "bulletins" : [
                    {
                        "title": "Raycaster Engine",
                        "description": "Currently engaged in the development of a Raycasting Engine utilizing the C programming language. This project is an endeavor to enhance proficiency in the application of pointers, as well as memory management. This will further solidify understanding of these critical aspects of systems programming.",
                        "dates": "April 2024",
                        "graphics": ["/resources/raycaster_demo1.gif", "/resources/raycaster_demo2.gif", "/resources/raycaster_demo3.gif"]
                    },
                    {
                        "title": "Raspberry Pi Development",
                        "description": [
                            "Implemented a network-wide ad-blocking solution using Pi-hole on a Raspberry Pi. This project involved setting up and configuring the Pi-hole to block web advertisements across all devices on my network.",
                            "Successfully blocked unwanted content without the need for browser-based ad-blockers, improving overall network performance.",
                            "Enhanced network security by setting up a Virtual Private Network (VPN) on the Raspberry Pi, allowing secure remote access to my home network.",
                            "Gained hands-on experience with network configuration, Linux system administration, and cybersecurity best practices."
                        ],
                        "dates": "March 2024"
                    },
                    {
                        "title": "Discord Bot",
                        "description": [
                            "Engineered an interactive Python-based bot for Discord, enhancing user engagement and community interaction.",
                            "Implemented a feature for automated birthday announcements, fostering a sense of community and personal connection among members.",
                            "Devised a welcoming system that sends personalized greetings to new members, promoting a friendly and inclusive environment.",
                            "Integrated a music playing feature in chat, enriching the user experience and fostering a lively community atmosphere."
                        ],
                        "dates": "2022"
                    },
                    {
                        "title": "Tutoring Tracking Tool",
                        "description": [
                            "Designed and implemented a Java-based comprehensive tutoring tracking tool aimed at streamlining the management of tutoring services.",
                            "Developed a feature for logging and tracking hours, enhancing the efficiency of time management for both tutors and students.",
                            "Implemented a sorting mechanism that categorizes tutors and students by their respective majors and courses, facilitating seamless matching of tutors with students.",
                            "The tool significantly improved the organization of tutoring services, leading to increased productivity and better resource allocation."
                        ],
                        "dates": "2019-2021"
                    },
                    {
                        "title": "Pen-Testing Tool",
                        "description": [
                            "Engineered a robust penetration testing application that integrates industry-standard tools such as Nmap and Wireshark into a unified Qt-based user interface.",
                            "Leveraged the power of the Cassandra database for efficient data management and retrieval, enhancing the tool’s performance and scalability.",
                            "Contributed to the promotion of robust security practices by enabling users to perform comprehensive network analysis and vulnerability assessments.",
                            "The tool significantly improved the efficiency and effectiveness of penetration testing, thereby strengthening defense mechanisms and promoting cybersecurity."
                        ],
                        "dates": "August 2020 – May 2021"
                    }
                ]
            },
            "leadership" : {
                "sectionTitle" : "Leadership Awards",
                "bulletins" : [
                    {
                        "title": "General Motors - eDiagnostics",
                        "description": [
                        "Manufacturing in 2030 Award Winners.",
                        "Enterprise Integration and Technology Finalists"
                        ],
                        "dates": "2023"
                    }
                ]
            },
            "education" : {
                "sectionTitle": "Education",
                "bulletins" : [
                    {
                        "title" : "The University of Texas at El Paso (UTEP)",
                        "description": "Bachelor of Science in Computer Science with a Minor in Mathematics",
                        "dates" : "August 2017 – May 2021"
                    }
                ]
            }
        }
    }
]