[
    {
        "mainHeader" : {
            "softwareDev" : "Desarrollador de Software Full-Stack"
        },
        "downloadButton" : "Descargar Perfil Personal",
        "dialogs" : {
            "settings": {
                "title":"Configuración",
                "languageSelect" : "Seleccione un idioma:",
                "languages" : ["Español", "Inglés"],
                "enable" : "Habilitar",
                "disable" : "Desactivar",
                "background" : "el fondo",
                "playGame" : "Iniciar el juego",
                "themeTitle" : "Seleccione una tema:",
                "themes" : {
                    "default": "Predeterminado",
                    "light": "Luz", 
                    "dark": "Oscuro"   
                }
            },
            "game": {
                "title" : "¡Fin!",
                "content" : "¡Sobreviviste {survivalTime} segundos!" 
            }
        },
        "sections" : {
            "personalStatement" : {
                "bulletins" : [
                    {
                        "title": "Declaración Personal" ,
                        "description" : "Desarrollador de software full-stack experimentado, hábil en el diseño e implementación de soluciones de software robustas. Competente en varios lenguajes de programación y marcos de trabajo, con un enfoque en la creación de aplicaciones eficientes y escalables. Conocido por entregar código de alta calidad y soluciones innovadoras que cumplen con los requisitos del proyecto y superan las expectativas del cliente."
                    }
                ]
            },
            "keySkills" : {
                "bulletins": [
                    {
                        "title" : "Competencias laborales",
                        "description": [
                            "Lenguajes de programación: Java, C#, Python, Go, Ruby, TypeScript, JavaScript, C/C++", 
                            "Desarrollo Frontend: React, Angular (13-16), Windows Presentation Foundation, Next.js, Node.js, HTML5, CSS, XML",
                            "Desarrollo Backend: Spring Boot, APIs RESTful, Go/Fiber, Web Services, SQL, PostgreSQL, Microsoft SQL Server",
                            "DevOps y Control de Versiones: Git, GitHub, CI/CD",
                            "Sistemas operativos: Windows, Linux",
                            "Metodologías: Agile, Scrum",
                            "Otras habilidades: Desarrollo full-stack, diseño de interfaz de usuario (UI), accesibilidad web, depuración"
                        ]
                    }
                ]
            },
            "experience" : {
                "sectionTitle" : "Experiencia",
                "bulletins" : [
                    {
                        "title" : "Bay Bridge Administrators - EDI Programador/Analista",
                        "description" : [
                            "Desarrollé un conjunto de herramientas para desencriptar, leer y convertir archivos de tipos CSV/XML/834 a un formato de archivo propietario.",
                            "Creé un proceso para la inscripción única de datos de suscriptores de seguros, que solía llevar más de 5 días y ahora solo toma 5 minutos, utilizando métodos estadísticos para mapear los datos de los suscriptores a la base de datos.",
                            "Desarrollé un backend en Go utilizando Fiber para acceder a los datos y utilizar las herramientas en el frontend.",
                            "Diseñé e implementé el frontend en C# Windows Presentation Foundation, que estandariza cómo el equipo de EDI informa errores en los archivos, organizando los errores de una manera significativa para que los coordinadores los utilicen cuando se comunican con los corredores para la verificación/corrección. Este frontend también agiliza el proceso de inscripción única, sigue pautas estrictas para proteger la información sensible según lo requiere la ley, proporciona una visualización en tiempo real de los datos con herramientas útiles, códigos de color para la detección rápida de errores, resalta números de línea para líneas de datos con errores e incluye diagnósticos de datos de archivos y resoluciones para ayudar a estandarizar y agilizar los informes de errores del equipo de EDI."    
                        ],
                        "dates" : "Current"
                    },
                    {
                        "title" : "General Motors - Desarrollador Líder de Software Full-Stack",
                        "description" : [
                            "Lideré el diseño y la implementación de una aplicación web de diagnóstico de vehículos que alimentaría datos en la aplicación web principal de eDiagnostics, que sirve como una herramienta dinámica para que los técnicos administren los pasos de diagnóstico y reparación, mejorando la eficiencia del flujo de trabajo",
                            "Diseñé un backend robusto con Java Spring Boot y diseñé una interfaz de usuario fácil de usar con Angular, informada por los conocimientos de la colaboración con ingenieros y técnicos de la línea de producción",
                            "El lanzamiento exitoso de esta aplicación mejoró el rendimiento de la producción, redujo los vehículos defectuosos y proporcionó una plataforma para la capacitación continua",
                            "La aplicación también cuenta con una capacidad única para resolver defectos. Inicialmente, resolvió alrededor de 2.000 defectos únicos de una lista cada vez mayor, en colaboración con un equipo de expertos. Diseñado para ser utilizado por otras personas calificadas, continúa mejorando la eficiencia del proceso de gestión de defectos"
                        ],
                        "dates" : "Junio 2022 – Febrero 2024"
                    },
                    {
                        "title" : "General Motors - Desarrollador de Software Full-Stack",
                        "description" : [
                            "Colaboré diariamente con ingenieros, diagnosticadores y líderes empresariales para desarrollar una aplicación web que capacita a los técnicos para resolver códigos de error durante el ensamblaje del vehículo",
                            "Diseñé soluciones frontend para trabajar en dispositivos móviles y de escritorio que mostraban la información de diagnóstico del vehículo de manera cohesiva", 
                            "Diseñé y desarrollé puntos finales de la API Restful para recopilar datos de defectos de vehículos"
                        ],
                        "dates" : "Noviembre 2021 – Junio 2022"
                    },
                    {
                        "title" : "General Motors - Desarrollador de Software",
                        "description" : [
                            "Colaboré con un equipo multifuncional para desarrollar un proceso simplificado para la creación y recopilación de miles de imágenes de datos sintéticos, mejorando la eficiencia de la recopilación de datos",
                            "Utilicé los datos sintéticos recopilados para mejorar el rendimiento de los sistemas de visión artificial, lo que condujo a resultados más precisos y confiables en aplicaciones del mundo real",
                            "Contribuí a la rigurosa capacitación y prueba de los sistemas de visión por computadora utilizando datos de imágenes sintéticas, asegurando la robustez y adaptabilidad de los sistemas a diversos defectos del vehículo"
                        ],
                        "dates" : "Julio 2021 – Noviembre 2021"
                    },
                    {
                        "title" : "The University of Texas at El Paso (UTEP) - ACES Coordinador/Tutor",
                        "description" : [
                            "Desarrollé una herramienta de seguimiento de tutoría basada en Java para agilizar los servicios de tutoría, mejorando la productividad y la asignación de recursos.",
                            "Creé funciones para registrar y rastrear horas y clasificar tutores y estudiantes por especializaciones y cursos, mejorando la gestión del tiempo y la coincidencia estudiante-tutor",
                            "Fui tutor de aproximadamente 35 estudiantes semanalmente en carreras como Ciencias de la Computación, Ingeniería Eléctrica, Negocios, etc., en materias como Ciencias de la Computación, Arquitectura de Computadores, Cálculo, Estadística y Física.",
                            "Implementé estrategias de tutoría personalizadas que mejoraron significativamente los puntajes de los cursos de los estudiantes y fomentaron un entorno de aprendizaje de apoyo"
                        ],
                        "dates" : "Marzo 2019 – Mayo 2021"
                    }
                ]
            },
            "project" : {
                "sectionTitle": "Proyectos",
                "bulletins" : [
                    {
                        "title": "Motor Raycaster",
                        "description": "Actualmente estoy involucrado en el desarrollo de un motor de raycasting utilizando el lenguaje de programación C. Este proyecto es un esfuerzo para mejorar la competencia en la aplicación de punteros, así como la gestión de la memoria. Esto solidificará aún más la comprensión de estos aspectos críticos de la programación de sistemas.",
                        "dates": "Abril 2024",
                        "graphics": ["/resources/raycaster_demo1.gif", "/resources/raycaster_demo2.gif", "/resources/raycaster_demo3.gif"]
                    },
                    {
                        "title": "Desarrollo de Raspberry Pi",
                        "description": [
                            "Implementé una solución de bloqueo de anuncios en toda la red utilizando Pi-hole en una Raspberry Pi. Este proyecto implicó la instalación y configuración de Pi-hole para bloquear los anuncios web en todos los dispositivos de mi red.", 
                            "Bloqueé con éxito el contenido no deseado sin necesidad de bloqueadores de anuncios basados en el navegador, lo que mejoró el rendimiento general de la red.", 
                            "Mejoré la seguridad de la red mediante la configuración de una red privada virtual (VPN) en la Raspberry Pi, lo que permite un acceso remoto seguro a mi red doméstica.", 
                            "Adquirí experiencia práctica con la configuración de redes, la administración de sistemas Linux y las mejores prácticas de ciberseguridad."
                        ],
                        "dates": "Marzo 2024"
                    },
                    {
                        "title": "Bot de Discord",
                        "description": [
                            "Diseñé un bot interactivo basado en Python para Discord, mejorando la participación de los usuarios y la interacción con la comunidad.",
                            "Implementé una función para anuncios de cumpleaños automatizados, fomentando un sentido de comunidad y conexión personal entre los miembros.",
                            "Ideé un sistema de bienvenida que envía saludos personalizados a los nuevos miembros, promoviendo un ambiente amigable e inclusivo.",
                            "Se integró una función de reproducción de música en el chat, enriqueciendo la experiencia del usuario y fomentando una animada atmósfera de comunidad."
                        ],
                        "dates": "2022"
                    },
                    {
                        "title": "Aplicación de Seguimiento de Tutoría",
                        "description": [
                            "Diseñé e implementé una aplicación integral de seguimiento de tutorías basada en Java destinada a agilizar la gestión de los servicios de tutoría.",
                            "Desarrollé una función para registrar y rastrear horas, mejorando la eficiencia de la gestión del tiempo tanto para los tutores como para los estudiantes.",
                            "Implementé un mecanismo de clasificación que clasifica a los tutores y estudiantes por sus respectivas especialidades y cursos, lo que facilita la coincidencia perfecta de tutores con estudiantes.",
                            "La aplicación mejoró significativamente la organización de los servicios de tutoría, lo que llevó a una mayor productividad y una mejor asignación de recursos."
                        ],
                        "dates": "2019-2021"
                    },
                    {
                        "title": "Aplicación de pruebas de penetración de ciberseguridad",
                        "description": [
                            "Diseñé una aplicación robusta de pruebas de penetración que integra herramientas estándar de la industria como Nmap y Wireshark en una interfaz de usuario unificada basada en Qt",
                            "Aprovechó el poder de la base de datos de Cassandra para una gestión y recuperación de datos eficientes, mejorando el rendimiento y la escalabilidad de la aplicación",
                            "Contribuyó a la promoción de prácticas de seguridad sólidas al permitir a los usuarios realizar análisis exhaustivos de la red y evaluaciones de vulnerabilidad.",
                            "La aplicación mejoró significativamente la eficiencia y la eficacia de las pruebas de penetración, fortaleciendo así los mecanismos de defensa y promoviendo la ciberseguridad."
                        ],
                        "dates": "Agosto 2020 – Mayo 2021"
                    }
                ]
            },
            "leadership" : {
                "sectionTitle" : "Premios al Liderazgo",
                "bulletins" : [
                    {
                        "title": "General Motors - eDiagnostics",
                        "description": [
                        "Premiados en \"Manufacturing in 2030\"",
                        "Finalistas de \"Enterprise Integration and Technology\""
                        ],
                        "dates": "2023"
                    }
                ]
            },
            "education" : {
                "sectionTitle": "Educación",
                "bulletins": [
                    {
                        "title" : "The University of Texas at El Paso (UTEP)",
                        "description": "Licenciatura en Ciencias de la Computación con especialización en Matemáticas",
                        "dates" : "Agosto 2017 – Mayo 2021"
                    }
                ]
            }
        }
    }
]