[
    {
        "mainHeader" : {
            "softwareDev" : "Desarrollador de Software"
        },
        "downloadButton" : "Descargar Perfil Personal",
        "dialogs" : {
            "settings": {
                "title":"Configuración",
                "languageSelect" : "Seleccione un idioma:",
                "languages" : ["Español", "Inglés"],
                "enable" : "Habilitar",
                "disable" : "Desactivar",
                "background" : "el fondo",
                "playGame" : "Iniciar el juego",
                "themeTitle" : "Seleccione una tema:",
                "themes" : {
                    "default": "Predeterminado",
                    "light": "Luz", 
                    "dark": "Oscuro"   
                }
            },
            "game": {
                "title" : "¡Fin!",
                "content" : "¡Sobreviviste {survivalTime} segundos!" 
            }
        },
        "sections" : {
            "personalStatement" : {
                "bulletins" : [
                    {
                        "title": "Declaración Personal" ,
                        "description" : "Desarrollador de software experimentado, hábil en el diseño e implementación de soluciones de software robustas. Competente en varios lenguajes de programación y marcos de trabajo, con un enfoque en la creación de aplicaciones eficientes y escalables. Conocido por entregar código de alta calidad y soluciones innovadoras que cumplen con los requisitos del proyecto y superan las expectativas del cliente."
                    }
                ]
            },
            "keySkills" : {
                "bulletins": [
                    {
                        "title" : "Competencias laborales",
                        "description": [
                            "Lenguajes de programación: Java, Python, TypeScript, JavaScript, C/C++", 
                            "Desarrollo Web: React, Angular (13-16), Next.js, Node.js, HTML5, CSS, XML",
                            "Desarrollo Backend: Spring Boot, APIs RESTful, Web Services, SQL, PostgreSQL, Microsoft SQL Server",
                            "DevOps y Control de Versiones: Git, GitHub, CI/CD",
                            "Sistemas operativos: Windows, Linux",
                            "Metodologías: Agile, Scrum",
                            "Otras habilidades: Desarrollo full-stack, diseño de interfaz de usuario (UI), accesibilidad web, depuración"
                        ]
                    }
                ]
            },
            "experience" : {
                "sectionTitle" : "Experiencia",
                "bulletins" : [
                    {
                        "title" : "General Motors - Desarrollador de Software",
                        "description" : [
                            "Investigué, diseñé y desarrollé una aplicación web para entrenar e implementar modelos de Procesamiento de Lenguaje Natural (PLN) en el diagnóstico y reparación de defectos de vehículos, ayudando significativamente en la capacitación de nuevos técnicos.", 
                            "Creé un backend robusto usando Java Spring Boot para extraer datos de fuentes en línea y almacenarlos en una base de datos PostgreSQL.", 
                            "Colaboré estrechamente con ingenieros y técnicos en plantas de producción para comprender sus necesidades y mejorar su eficiencia a través de una interfaz de usuario completa y sencilla utilizando Angular.",
                            "Realicé un extenso autoestudio en PNL y Machine Learning, aplicando con éxito este conocimiento para construir pipelines efectivos a pesar de no tener experiencia previa en estas áreas.",
                            "La finalización exitosa de la aplicación web condujo a un mejor rendimiento en la producción, una disminución de los productos defectuosos y proporcionó una plataforma para la capacitación continua en nuevas tecnologías",
                            "Llevé a cabo una investigación en profundidad y desarrollé soluciones para un equipo de generación de imágenes sintéticas, mejorando los modelos de visión artificial de IA"
                        ],
                        "dates" : "Julio 2021 – Febrero 2024"
                    },
                    {
                        "title" : "The University of Texas at El Paso (UTEP) - ACES Coordinador/Tutor",
                        "description" : [
                            "Desarrollé una herramienta de seguimiento de tutoría basada en Java para agilizar los servicios de tutoría, mejorando la productividad y la asignación de recursos.",
                            "Creé funciones para registrar y rastrear horas y clasificar tutores y estudiantes por especializaciones y cursos, mejorando la gestión del tiempo y la coincidencia estudiante-tutor",
                            "Fui tutor de aproximadamente 35 estudiantes semanalmente en carreras como Ciencias de la Computación, Ingeniería Eléctrica, Negocios, etc., en materias como Ciencias de la Computación, Arquitectura de Computadores, Cálculo, Estadística y Física.",
                            "Implementé estrategias de tutoría personalizadas que mejoraron significativamente los puntajes de los cursos de los estudiantes y fomentaron un entorno de aprendizaje de apoyo"
                        ],
                        "dates" : "Marzo 2019 – Mayo 2021"
                    }
                ]
            },
            "project" : {
                "sectionTitle": "Proyectos",
                "bulletins" : [
                    {
                        "title": "Motor Raycaster",
                        "description": "Actualmente estoy involucrado en el desarrollo de un motor de raycasting utilizando el lenguaje de programación C. Este proyecto es un esfuerzo para mejorar la competencia en la aplicación de punteros, así como la gestión de la memoria. Esto solidificará aún más la comprensión de estos aspectos críticos de la programación de sistemas.",
                        "dates": "Abril 2024",
                        "graphics": ["/resources/raycaster_demo1.gif", "/resources/raycaster_demo2.gif", "/resources/raycaster_demo3.gif"]
                    },
                    {
                        "title": "Desarrollo de Raspberry Pi",
                        "description": [
                            "Implementé una solución de bloqueo de anuncios en toda la red utilizando Pi-hole en una Raspberry Pi. Este proyecto implicó la instalación y configuración de Pi-hole para bloquear los anuncios web en todos los dispositivos de mi red.", 
                            "Bloqueé con éxito el contenido no deseado sin necesidad de bloqueadores de anuncios basados en el navegador, lo que mejoró el rendimiento general de la red.", 
                            "Mejoré la seguridad de la red mediante la configuración de una red privada virtual (VPN) en la Raspberry Pi, lo que permite un acceso remoto seguro a mi red doméstica.", 
                            "Adquirí experiencia práctica con la configuración de redes, la administración de sistemas Linux y las mejores prácticas de ciberseguridad."
                        ],
                        "dates": "Marzo 2024"
                    },
                    {
                        "title": "Bot de Discord",
                        "description": [
                            "Diseñé un bot interactivo basado en Python para Discord, mejorando la participación de los usuarios y la interacción con la comunidad.",
                            "Implementé una función para anuncios de cumpleaños automatizados, fomentando un sentido de comunidad y conexión personal entre los miembros.",
                            "Ideé un sistema de bienvenida que envía saludos personalizados a los nuevos miembros, promoviendo un ambiente amigable e inclusivo.",
                            "Se integró una función de reproducción de música en el chat, enriqueciendo la experiencia del usuario y fomentando una animada atmósfera de comunidad."
                        ],
                        "dates": "2022"
                    },
                    {
                        "title": "Aplicación de Seguimiento de Tutoría",
                        "description": [
                            "Diseñé e implementé una aplicación integral de seguimiento de tutorías basada en Java destinada a agilizar la gestión de los servicios de tutoría.",
                            "Desarrollé una función para registrar y rastrear horas, mejorando la eficiencia de la gestión del tiempo tanto para los tutores como para los estudiantes.",
                            "Implementé un mecanismo de clasificación que clasifica a los tutores y estudiantes por sus respectivas especialidades y cursos, lo que facilita la coincidencia perfecta de tutores con estudiantes.",
                            "La aplicación mejoró significativamente la organización de los servicios de tutoría, lo que llevó a una mayor productividad y una mejor asignación de recursos."
                        ],
                        "dates": "2019-2021"
                    },
                    {
                        "title": "Aplicación de pruebas de penetración de ciberseguridad",
                        "description": [
                            "Diseñé una aplicación robusta de pruebas de penetración que integra herramientas estándar de la industria como Nmap y Wireshark en una interfaz de usuario unificada basada en Qt",
                            "Aprovechó el poder de la base de datos de Cassandra para una gestión y recuperación de datos eficientes, mejorando el rendimiento y la escalabilidad de la aplicación",
                            "Contribuyó a la promoción de prácticas de seguridad sólidas al permitir a los usuarios realizar análisis exhaustivos de la red y evaluaciones de vulnerabilidad.",
                            "La aplicación mejoró significativamente la eficiencia y la eficacia de las pruebas de penetración, fortaleciendo así los mecanismos de defensa y promoviendo la ciberseguridad."
                        ],
                        "dates": "Agosto 2020 – Mayo 2021"
                    }
                ]
            },
            "leadership" : {
                "sectionTitle" : "Premios al Liderazgo",
                "bulletins" : [
                    {
                        "title": "General Motors - eDiagnostics",
                        "description": [
                        "Premiados en \"Manufacturing in 2030\"",
                        "Finalistas de \"Enterprise Integration and Technology\""
                        ],
                        "dates": "2023"
                    }
                ]
            },
            "education" : {
                "sectionTitle": "Educación",
                "bulletins": [
                    {
                        "title" : "The University of Texas at El Paso (UTEP)",
                        "description": "Licenciatura en Ciencias de la Computación con especialización en Matemáticas",
                        "dates" : "Agosto 2017 – Mayo 2021"
                    }
                ]
            }
        }
    }
]